---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeMaximumRiserHeight
source: html/8f7ba3ed-5fd8-51df-e047-5ee25f0e3cab.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeMaximumRiserHeight Property

"Max. Riser Height": Maximum Riser Height

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeMaximumRiserHeight { get; }
```